package com.example.lab2android

class FavoritesRepository {

    fun getMovies(): List<Movie> = listOf(
        Movie("Аватар", 2009, listOf("Фантастика", "Пригоди", "Екшн")),
        Movie("Інтерстеллар", 2014, listOf("Sci-Fi", "Драма", "Пригоди")),
        Movie("Джон Вік", 2014, listOf("Бойовик", "Трилер")),
        Movie("Форсаж", 2001, listOf("Бойовик", "Кримінал", "Автомобілі")),
        Movie("Термінатор 2", 1991, listOf("Бойовик", "Sci-Fi"))
    )

    fun getBooks(): List<Book> = listOf(
        Book("Відьмак", "Анджей Сапковський", 320),
        Book("Кайдашева сім'я", "Іван Нечуй-Левицький", 200),
        Book("1984", "Джордж Орвелл", 328),
        Book("Маленький принц", "Антуан де Сент-Екзюпері", 96),
        Book("Хроніки Нарнії", "Клайв Стейплз Льюїс", 350),
        Book("Тіні забутих предків", "Михайло Коцюбинський", 120),
        Book("Мистецтво війни", "Сунь-цзи", 160),
        Book("Пікнік на узбіччі", "Брати Стругацькі", 290),
        Book("Хоббіт", "Дж. Р. Р. Толкін", 310),
        Book("Місто", "Валер'ян Підмогильний", 280)
    )
}